{
  "currentAffairs": [
    {
      "id": "ca1750408200-4375e364",
      "title": "High Seas Treaty Ratified at UN Oceans Conference",
      "content": "The United Nations Oceans Conference (UNOC) recently concluded in France. This event marked milestone in global marine conservation. The conference focused on the Biodiversity Beyond National Jurisdiction (BBNJ) agreement, commonly referred to as the High Seas Treaty. This treaty aims to protect oceans and establish marine-protected areas in international waters. The UNOC is a platform for countries to discuss and accelerate action on ocean conservation. The third edition of the conference sought to address the urgent need for marine protection. It aimed to prevent over-fishing and regulate deep-sea mining in areas not owned by any nation. The conferences goals align with the broader Convention on Biological Diversity, which commits nations to protect 30 of marine and coastal areas by 2030. The BBNJ agreement is crucial for conserving marine biodiversity. It requires 60 ratifications to become legally binding. As of the conferences conclusion, 56 countries had ratified the treaty. This agreement focuses on creating marine protected areas beyond national jurisdiction, conducting environmental impact assessments, and regulating marine genetic resources. It also emphasises capacity-building for developing nations to enhance their ocean governance. Despite the positive developments, several challenges remain. The most contentious issue is the sharing of benefits derived from marine resources. The high seas host unique life-forms, and there is no consensus on how to distribute profits from their extraction. Environmental groups have raised concerns that without strict regulations, the oceans may face irreversible damage. The UNOC yielded a number of voluntary commitments from various nations. The European Commission pledged 1 billion euros for ocean conservation and sustainable fishing. French Polynesia announced plans to create the worlds largest marine protected area, covering five million square kilometres. New Zealand allocated over 52 million for ocean governance in the Pacific. Germany initiated a 100 million euro programme for recovering munitions from its seas. Additionally, a coalition of 37 countries launched the High Ambition Coalition for a Quiet Ocean to combat ocean noise pollution. Italy committed 6.5 million euros to enhance surveillance in marine protected areas. Canada contributed 9 million to improve resilience against climate change for Small Island Developing States. Spain pledged to establish five new marine protected areas, aiming to protect 25 of its marine territory.",
      "category": "International Affairs",
      "source": "GKToday",
      "sourceUrl": "https://www.gktoday.in/high-seas-treaty-ratified-at-un-oceans-conference/",
      "datePublished": "2025-06-20T14:00:00.129171",
      "importance": "medium"
    },
    {
      "id": "ca1750408201-579d73f1",
      "title": "FASTag Annual Pass Scheme",
      "content": "The FASTag Annual Pass scheme was introduced in June 2025 by Union Minister of Road Transport and Highways Nitin Gadkari. This initiative aims to enhance convenience for non-commercial private vehicle owners travelling on national highways. The scheme is designed to address long-standing issues at toll plazas, providing a streamlined and cost-effective solution for frequent travellers. FASTag is an electronic toll collection system managed by the National Payments Corporation of India (NPCI) and the National Highways Authority of India (NHAI). Launched in 2014, it became mandatory in 2021 for all toll plazas across India. The system uses a sticker affixed to the vehicles windscreen, allowing automatic toll payments. The FASTag Annual Pass is priced at Rs 3,000 and is valid for one year or up to 200 trips, whichever occurs first. The pass allows free passage at National Highway (NH) and National Expressway (NE) toll plazas. Users can save approximately Rs 7,000 compared to regular toll payments, as the average cost per crossing is reduced to Rs 15. To activate the Annual Pass, users must ensure their FASTag meets eligibility criteria. This includes being properly affixed, linked to a valid vehicle registration number, and not blacklisted. Activation occurs after a successful payment through the Rajmargyatra mobile application or the NHAI website. For point-based fee plazas, each crossing counts as one trip. A round trip is counted as two trips. For closed tolling plazas, one entry and exit pair is considered one trip. This system allows for straightforward tracking of usage under the Annual Pass.",
      "category": "Government & Policy",
      "source": "GKToday",
      "sourceUrl": "https://www.gktoday.in/fastag-annual-pass-scheme/",
      "datePublished": "2025-06-19T14:00:01.243495",
      "importance": "medium"
    },
    {
      "id": "ca1750408183-e38d5b32",
      "title": "Performance Grading Index (PGI) 2.0 Report",
      "content": "Context: The Ministry of Education released the Performance Grading Index (PGI) 2.0 report for 2022-23 and 2023-24, ranking StatesUTs on school education. Summary  Trends in Performance Grading Index (PGI) 2.0 Report: PGI 2.0 is a robust benchmarking tool aligned with NEP 2020. While progress is evident, India must intensify efforts to address learning gaps, governance bottlenecks, and infrastructure inequalities to meet SDG 4 by 2030",
      "category": "Government & Policy",
      "source": "Insights IAS",
      "sourceUrl": "https://www.insightsonindia.com/2025/06/19/upsc-current-affairs-19-june-2025/",
      "datePublished": "2025-06-19T13:59:42.278755",
      "importance": "high"
    },
    {
      "id": "ca1750408189-9b4669d2",
      "title": "Viksit Bharat Ka Amrit Kaal Report",
      "content": "Context: The Government of India released a comprehensive report titled Viksit Bharat Ka Amrit Kaal: Seva, Sushasan, Garib Kalyan ke 11 Saal, marking 11 years of governance under PM Narendra Modi. About Summary of Viksit Bharat Ka Amrit Kaal Report: Over the past 11 years, the central government has ushered in a transformative era rooted in inclusive growth, digital empowerment, and national pride.",
      "category": "Government & Policy",
      "source": "Insights IAS",
      "sourceUrl": "https://www.insightsonindia.com/2025/06/16/upsc-current-affairs-16-june-2025/",
      "datePublished": "2025-06-16T13:59:42.278755",
      "importance": "high"
    },
    {
      "id": "ca1750408189-c5850ba9",
      "title": "Policy Reforms to Boost the Ease of Doing Research",
      "content": "Context: The Union Minister of Science  Technology announced sweeping policy reforms to boost the Ease of Innovation, Ease of Doing Research, and Ease of Science in India. About Policy Reforms to Boost the Ease of Doing Research:",
      "category": "Government & Policy",
      "source": "Insights IAS",
      "sourceUrl": "https://www.insightsonindia.com/2025/06/16/upsc-current-affairs-16-june-2025/",
      "datePublished": "2025-06-16T13:59:42.278755",
      "importance": "high"
    }
  ],
  "lastUpdated": "2025-06-20T13:59:38.684270",
  "sources": [
    "GKToday",
    "Insights IAS"
  ],
  "categories": [
    "International Affairs",
    "Government & Policy"
  ],
  "weeklyUpdate": {
    "lastWeeklyUpdate": "2025-06-20T14:00:01.245950",
    "totalAffairs": 5,
    "weeksOfData": 6,
    "updateFrequency": "Weekly - Every Sunday"
  }
}