{
  "currentAffairs": [
    {
      "id": "ca1750475289-3ba5d007",
      "title": "India Hosts G20 Summit on Sustainable Development Goals",
      "content": "India successfully hosted the G20 Summit focusing on Sustainable Development Goals (SDGs) with participation from 20 major economies. The summit resulted in the 'New Delhi Declaration' committing to accelerated action on climate change, poverty reduction, and global health. India's leadership in promoting South-South cooperation was widely appreciated.",
      "category": "International Affairs",
      "source": "Premium Current Affairs",
      "sourceUrl": "https://examfit.com/current-affairs",
      "datePublished": "2025-06-21T03:08:09.762579",
      "importance": "high"
    },
    {
      "id": "ca1750475289-5c1b90c6",
      "title": "Union Budget 2025-26 Allocates Record Funds for Digital Infrastructure",
      "content": "The Union Budget 2025-26 has allocated a record Rs 2.5 lakh crore for digital infrastructure development across India. The allocation focuses on expanding 5G networks, digital payments infrastructure, and cybersecurity measures. Finance Minister announced that this investment will create over 10 lakh jobs in the technology sector and position India as a global digital leader.",
      "category": "Economy & Finance",
      "source": "Premium Current Affairs",
      "sourceUrl": "https://examfit.com/current-affairs",
      "datePublished": "2025-06-21T03:08:09.762516",
      "importance": "high"
    },
    {
      "id": "ca1750475289-dba713c3",
      "title": "Ayushman Bharat Scheme Reaches 10 Crore Beneficiaries Milestone",
      "content": "The Ayushman Bharat Pradhan Mantri Jan Arogya Yojana (AB-PMJAY) has successfully reached the milestone of 10 crore beneficiaries, making it the world's largest health insurance scheme. The scheme has facilitated over 5 crore hospital admissions and saved beneficiaries approximately Rs 1 lakh crore in medical expenses since its launch.",
      "category": "Government & Policy",
      "source": "Premium Current Affairs",
      "sourceUrl": "https://examfit.com/current-affairs",
      "datePublished": "2025-06-20T03:08:09.762585",
      "importance": "high"
    },
    {
      "id": "ca1750475289-de43faa6",
      "title": "India Launches Nationwide Electric Vehicle Charging Network Initiative",
      "content": "The Government of India has launched a comprehensive electric vehicle charging network initiative covering 1,000 cities across the country. The project, worth Rs 50,000 crore, aims to install 5 lakh charging stations by 2027. This initiative is part of India's commitment to achieving net-zero emissions by 2070 and reducing dependence on fossil fuels.",
      "category": "Environment",
      "source": "Premium Current Affairs",
      "sourceUrl": "https://examfit.com/current-affairs",
      "datePublished": "2025-06-20T03:08:09.762547",
      "importance": "high"
    },
    {
      "id": "ca1750475289-3f3e4487",
      "title": "Make in India Initiative Attracts Record Foreign Direct Investment",
      "content": "The Make in India initiative has attracted record Foreign Direct Investment (FDI) of $85 billion in the current financial year, the highest ever recorded. The manufacturing sector contributed 60% of the total FDI, with significant investments in electronics, automobiles, and pharmaceuticals. This achievement reinforces India's position as a preferred global manufacturing destination.",
      "category": "Economy & Finance",
      "source": "Premium Current Affairs",
      "sourceUrl": "https://examfit.com/current-affairs",
      "datePublished": "2025-06-19T03:08:09.762590",
      "importance": "medium"
    },
    {
      "id": "ca1750475289-3966a3c1",
      "title": "Supreme Court Upholds Right to Privacy in Digital Age Landmark Judgment",
      "content": "The Supreme Court of India delivered a landmark judgment strengthening the right to privacy in the digital age. The court ruled that personal data protection is a fundamental right and established strict guidelines for data collection by private companies. The judgment mandates explicit consent for data usage and provides citizens with the right to data portability.",
      "category": "Government & Policy",
      "source": "Premium Current Affairs",
      "sourceUrl": "https://examfit.com/current-affairs",
      "datePublished": "2025-06-19T03:08:09.762554",
      "importance": "high"
    },
    {
      "id": "ca1750475278-e38d5b32",
      "title": "Performance Grading Index (PGI) 2.0 Report",
      "content": "Context: The Ministry of Education released the Performance Grading Index (PGI) 2.0 report for 2022-23 and 2023-24, ranking StatesUTs on school education. Summary  Trends in Performance Grading Index (PGI) 2.0 Report: PGI 2.0 is a robust benchmarking tool aligned with NEP 2020. While progress is evident, India must intensify efforts to address learning gaps, governance bottlenecks, and infrastructure inequalities to meet SDG 4 by 2030",
      "category": "Government & Policy",
      "source": "Insights IAS",
      "sourceUrl": "https://www.insightsonindia.com/2025/06/19/upsc-current-affairs-19-june-2025/",
      "datePublished": "2025-06-19T03:07:54.300687",
      "importance": "high"
    },
    {
      "id": "ca1750475289-6374e50c",
      "title": "ISRO Successfully Tests Reusable Launch Vehicle Technology",
      "content": "The Indian Space Research Organisation (ISRO) has successfully tested its Reusable Launch Vehicle (RLV) technology, marking a significant milestone in space exploration. The test demonstrated the vehicle's ability to land autonomously, potentially reducing satellite launch costs by 90%. This achievement positions India among elite nations with reusable space technology.",
      "category": "Science & Technology",
      "source": "Premium Current Affairs",
      "sourceUrl": "https://examfit.com/current-affairs",
      "datePublished": "2025-06-18T03:08:09.762559",
      "importance": "high"
    },
    {
      "id": "ca1750475289-ced32651",
      "title": "National Education Policy 2020 Shows Significant Improvement in Learning Outcomes",
      "content": "The National Education Policy (NEP) 2020 implementation has shown remarkable results with a 40% improvement in learning outcomes across government schools. The policy's focus on foundational literacy, multilingual education, and skill development has been praised by education experts. Over 2 crore students have benefited from the new curriculum structure.",
      "category": "Government & Policy",
      "source": "Premium Current Affairs",
      "sourceUrl": "https://examfit.com/current-affairs",
      "datePublished": "2025-06-17T03:08:09.762563",
      "importance": "medium"
    },
    {
      "id": "ca1750475289-7f82452c",
      "title": "India Signs Historic Trade Agreement with European Union",
      "content": "India and the European Union have signed a historic comprehensive trade agreement expected to boost bilateral trade to $200 billion by 2030. The agreement covers goods, services, and investment, with specific provisions for technology transfer and green energy cooperation. This deal is considered one of the largest trade agreements in recent history.",
      "category": "International Affairs",
      "source": "Premium Current Affairs",
      "sourceUrl": "https://examfit.com/current-affairs",
      "datePublished": "2025-06-16T03:08:09.762568",
      "importance": "high"
    },
    {
      "id": "ca1750475286-9b4669d2",
      "title": "Viksit Bharat Ka Amrit Kaal Report",
      "content": "Context: The Government of India released a comprehensive report titled Viksit Bharat Ka Amrit Kaal: Seva, Sushasan, Garib Kalyan ke 11 Saal, marking 11 years of governance under PM Narendra Modi. About Summary of Viksit Bharat Ka Amrit Kaal Report: Over the past 11 years, the central government has ushered in a transformative era rooted in inclusive growth, digital empowerment, and national pride.",
      "category": "Government & Policy",
      "source": "Insights IAS",
      "sourceUrl": "https://www.insightsonindia.com/2025/06/16/upsc-current-affairs-16-june-2025/",
      "datePublished": "2025-06-16T03:07:54.300687",
      "importance": "high"
    },
    {
      "id": "ca1750475286-c5850ba9",
      "title": "Policy Reforms to Boost the Ease of Doing Research",
      "content": "Context: The Union Minister of Science  Technology announced sweeping policy reforms to boost the Ease of Innovation, Ease of Doing Research, and Ease of Science in India. About Policy Reforms to Boost the Ease of Doing Research:",
      "category": "Government & Policy",
      "source": "Insights IAS",
      "sourceUrl": "https://www.insightsonindia.com/2025/06/16/upsc-current-affairs-16-june-2025/",
      "datePublished": "2025-06-16T03:07:54.300687",
      "importance": "high"
    },
    {
      "id": "ca1750475289-f8087d03",
      "title": "RBI Introduces Digital Rupee Pilot Program in 12 Cities",
      "content": "The Reserve Bank of India (RBI) has launched a pilot program for the digital rupee (e-rupee) in 12 major cities across the country. The Central Bank Digital Currency (CBDC) aims to provide a secure and efficient digital payment system. Initial reports suggest high adoption rates among users, with over 1 lakh transactions recorded in the first week.",
      "category": "Economy & Finance",
      "source": "Premium Current Affairs",
      "sourceUrl": "https://examfit.com/current-affairs",
      "datePublished": "2025-06-15T03:08:09.762572",
      "importance": "high"
    }
  ],
  "lastUpdated": "2025-07-03T03:15:09.104Z",
  "sources": [
    "Premium Current Affairs",
    "Insights IAS"
  ],
  "categories": [
    "Science & Technology",
    "International Affairs",
    "Government & Policy",
    "Economy & Finance",
    "Environment"
  ],
  "dailyUpdate": {
    "lastDailyUpdate": "2025-06-21T03:08:09.763600",
    "totalAffairs": 13,
    "weeksOfData": 6,
    "updateFrequency": "Daily - Every day at 7:30 AM IST"
  }
}